Revit 2027 API
Rebar.CanElementBeSplit Method
 Checks if the element is a rebar that can be split.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool CanElementBeSplit(
	Document document,
	ElementId elementIdToCheck
)
Public Shared Function CanElementBeSplit (
	document As Document,
	elementIdToCheck As ElementId
) As Boolean
public:
static bool CanElementBeSplit(
	Document^ document,
	ElementId^ elementIdToCheck
)
static member CanElementBeSplit :
        document : Document *
        elementIdToCheck : ElementId -> bool
Parameters
document Document
 The document
elementIdToCheck ElementId
 The elementId that need to be checked
Return Value
Boolean
 Returns true if the element is a Rebar that can be split, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
Free Form Rebars other than 3D Path or Morphed, rebar sets with only one bar included or rebars that are part of a group can't be split.
Morphed Free Form Rebars that targets Spiral or Lapped Circle shapes can't be split.
See Also
Reference
Rebar Class
Autodesk.Revit.DB.Structure Namespace